/*
 * MVV_lr1.cpp
 *
 *  Created on: 22 жовт. 2023 р.
 *      Author: mikha
 */

#include <iostream>
#include <cmath> // Підключення бібліотеки для функції pow()
using namespace std;

int main()
{
	// Завдання Begine2
    // Декларація змінних
    double a, S;

    // Введення змінної
    	cout << "Enter a: ";
    	cin >> a;

    // Обчислення площі (квадрату числа a)
    S = pow(a, 2);

    printf("Зав2_Знайти площу квадрату\n"); //Виведення назви завдання 2

    // Вивід результату
    	cout << "Square: " << S << endl;

//---------------------------------------------------------------------//

    // Завдання Begine10

    // Декларація змінних
    double R1, R2, Pi=3.14;
    	cout << "R1=";
    	cin >> R1;
    	cout << "R2=";
    	cin >> R2;

    printf("Зав10_Знайти влощу кіл\n"); //Виведення назви завдання 10

    // Перевірка, чи R2 менший за R1
        if (R2 >= R1) {
            cout << "Помилка: R2 повинен бути менший за R1." << endl;
            return 1;
        }

    // Обчислення площі кола S1
    double S1 = Pi*pow(R1,2);

    // Обчислення площі кола S2
    double S2 = Pi*pow(R2,2);

    // Обчислення площі кола S3
    double S3 = S1-S2;

    // Вивід результату
        cout << "S1=" << S1 << endl;
        cout << "S2=" << S2 << endl;
        cout << "S3=" << S3 << endl;

    return 0;
}


